MCUdude/MiniCore/avr/boards.txt
168.menu.clock.8MHz_internal=8 MHz internal
168.menu.clock.8MHz_internal.upload.speed=38400
168.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.8MHz_internal.build.f_cpu=8000000L

168.menu.clock.1MHz_internal=1 MHz internal
168.menu.clock.1MHz_internal.upload.speed=9600
168.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
168.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.1MHz_internal.build.f_cpu=1000000L


#########################
#### ATmega88/A/P/PA ####
#########################

88.name=ATmega88
88.upload.tool=avrdude
88.upload.protocol=arduino
88.upload.maximum_size=7680
88.upload.maximum_data_size=1024

88.bootloader.tool=avrdude
88.bootloader.unlock_bits=0x3f
88.bootloader.lock_bits=0x0f
88.bootloader.extended_fuses=0xfc

88.build.core=arduino:arduino
88.build.board=AVR_ATmega88
88.build.variant=standard

# Variants
88.menu.variant.modelP=88P / 88PA
88.menu.variant.modelP.build.mcu=atmega88p
88.menu.variant.modelNonP=88 / 88A
88.menu.variant.modelNonP.build.mcu=atmega88

# Brown out detection
88.menu.BOD.2v7=2.7v
88.menu.BOD.2v7.bootloader.high_fuses=0xd5
88.menu.BOD.4v3=4.3v
88.menu.BOD.4v3.bootloader.high_fuses=0xd4
88.menu.BOD.1v8=1.8v
88.menu.BOD.1v8.bootloader.high_fuses=0xd6
88.menu.BOD.disabled=Disabled
88.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
88.menu.LTO.Os=Disabled (default)
88.menu.LTO.Os.compiler.c.extra_flags=
88.menu.LTO.Os.compiler.c.elf.extra_flags=
88.menu.LTO.Os.compiler.cpp.extra_flags=
88.menu.LTO.Os.ltoarcmd=avr-ar

88.menu.LTO.Os_flto=Enabled
88.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
88.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
88.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
88.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
88.menu.clock.16MHz_external=16 MHz external
88.menu.clock.16MHz_external.upload.speed=115200
88.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.16MHz_external.build.f_cpu=16000000L

88.menu.clock.20MHz_external=20 MHz external
88.menu.clock.20MHz_external.upload.speed=115200
88.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.20MHz_external.build.f_cpu=20000000L

88.menu.clock.18_432MHz_external=18.432 MHz external
88.menu.clock.18_432MHz_external.upload.speed=115200
88.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.18_432MHz_external.build.f_cpu=18432000L

88.menu.clock.12MHz_external=12 MHz external
88.menu.clock.12MHz_external.upload.speed=57600
88.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.12MHz_external.build.f_cpu=12000000L

88.menu.clock.8MHz_external=8 MHz external
88.menu.clock.8MHz_external.upload.speed=38400
88.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.8MHz_external.build.f_cpu=8000000L

88.menu.clock.8MHz_internal=8 MHz internal
88.menu.clock.8MHz_internal.upload.speed=38400
88.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.8MHz_internal.build.f_cpu=8000000L

88.menu.clock.1MHz_internal=1 MHz internal
88.menu.clock.1MHz_internal.upload.speed=9600
88.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
88.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.1MHz_internal.build.f_cpu=1000000L


##########################
#### ATmega48/A/P/PA ####
##########################

48.name=ATmega48 (no bootloader)
48.upload.tool= avrdude
48.upload.protocol=arduino
48.upload.maximum_size=4096
48.upload.maximum_data_size=512

48.bootloader.tool=avrdude
48.bootloader.unlock_bits=0x3f
48.bootloader.lock_bits=0x3f
48.bootloader.extended_fuses=0xff

48.build.core=arduino:arduino
48.build.board=AVR_ATmega48
48.build.variant=standard

# Variants
48.menu.variant.modelP=48P / 48PA
48.menu.variant.modelP.build.mcu=atmega48p
48.menu.variant.modelNonP=48 / 48A
48.menu.variant.modelNonP.build.mcu=atmega48

# Brown out detection
48.menu.BOD.2v7=2.7v
48.menu.BOD.2v7.bootloader.high_fuses=0xd5
48.menu.BOD.4v3=4.3v
48.menu.BOD.4v3.bootloader.high_fuses=0xd4
48.menu.BOD.1v8=1.8v
48.menu.BOD.1v8.bootloader.high_fuses=0xd6
48.menu.BOD.disabled=Disabled
48.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
48.menu.LTO.Os=Disabled (default)
48.menu.LTO.Os.compiler.c.extra_flags=
48.menu.LTO.Os.compiler.c.elf.extra_flags=
48.menu.LTO.Os.compiler.cpp.extra_flags=
48.menu.LTO.Os.ltoarcmd=avr-ar

48.menu.LTO.Os_flto=Enabled
48.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
48.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
48.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
48.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
48.menu.clock.16MHz_external=16 MHz external
48.menu.clock.16MHz_external.upload.speed=115200
48.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.16MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.16MHz_external.build.f_cpu=16000000L

48.menu.clock.20MHz_external=20 MHz external
48.menu.clock.20MHz_external.upload.speed=115200
48.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.20MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.20MHz_external.build.f_cpu=20000000L

48.menu.clock.18_432MHz_external=18.432 MHz external
48.menu.clock.18_432MHz_external.upload.speed=115200
48.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.18_432MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.18_432MHz_external.build.f_cpu=18432000L

48.menu.clock.12MHz_external=12 MHz external
48.menu.clock.12MHz_external.upload.speed=57600
48.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.12MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.12MHz_external.build.f_cpu=12000000L

